def transliterate_MEA(text):

	from re import sub

	eanc = (('ու', 'u'), ('ւ', 'w'), ('ա', 'a'), ('բ', 'b'), ('գ', 'g'), ('դ', 'd'), ('ե', 'e'), ('զ', 'z'), ('է', 'ē'), ('ը', 'ə'), ('թ', 't‘'), ('ժ', 'ž'), ('ի', 'i'), ('լ', 'l'), ('խ', 'x'), ('ծ', 'c'), ('կ', 'k'), ('հ', 'h'), ('ձ', 'j'), ('ղ', 'ġ'), ('ճ', 'č'), ('մ', 'm'), ('յ', 'y'), ('ն', 'n'), ('շ', 'š'), ('ո', 'o'), ('չ', 'č‘'), ('պ', 'p'), ('ջ', 'ĵ'), ('ռ', 'ŕ'), ('ս', 's'), ('վ', 'v'), ('տ', 't'), ('ր', 'r'), ('ց', 'c‘'), ('փ', 'p‘'), ('ք', 'k‘'), ('օ', 'ō'), ('ֆ', 'f'), ('և', 'ew'))
	eanc_upper = (('ՈՒ', 'U'), ('Ու', 'U'), ('Ւ', 'W'), ('Ա', 'A'), ('Բ', 'B'), ('Գ', 'G'), ('Դ', 'D'), ('Ե', 'E'), ('Զ', 'Z'), ('Է', 'Ē'), ('Ը', 'Ə'), ('Թ', 'T‘'), ('Ժ', 'Ž'), ('Ի', 'I'), ('Լ', 'L'), ('Խ', 'X'), ('Ծ', 'C'), ('Կ', 'K'), ('Հ', 'H'), ('Ձ', 'J'), ('Ղ', 'Ġ'), ('Ճ', 'Č'), ('Մ', 'M'), ('Յ', 'Y'), ('Ն', 'N'), ('Շ', 'Š'), ('Ո', 'O'), ('Չ', 'Č‘'), ('Պ', 'P'), ('Ջ', 'Ĵ'), ('Ռ', 'Ŕ'), ('Ս', 'S'), ('Վ', 'V'), ('Տ', 'T'), ('Ր', 'R'), ('Ց', 'C‘'), ('Փ', 'P‘'), ('Ք', 'K‘'), ('Օ', 'Ō'), ('Ֆ', 'F'))
	# եւ is processed as two separate letters, as well as եվ

	result = text

	# firstly upper, otherwise Ու would produce wrong *ow
	for i in eanc_upper:
		result = sub(i[0], i[1], result)
	for i in eanc:
		result = sub(i[0], i[1], result)

	return result